<template>
  <q-page class="bg-grey-3 column">
    <div class="row q-pa-sm bg-primary bg-white">
      <q-input
        v-model="newTask"
        @keyup.enter="addTask"
        class="col"
        square
        filled
        placeholder="감상문 추가"
        dense
        style="background-color: white; margin-top: 20px"
      >
        <template v-slot:append>
          <q-btn @click="addTask" round dense flat icon="add" />
        </template>
      </q-input>
    </div>
    <q-list class="bg-white" separator bordered>
      <q-item
        v-for="(task, index) in tasks"
        :key="task.title"
        @click="task.done = !task.done"
        :class="{ 'done bg-blue-1': task.done }"
        v-ripple
      >
        <q-item-section avatar> </q-item-section>
        <q-item-section>
          <q-item-label class="toDoTitle">{{ task.title }}</q-item-label>
        </q-item-section>
        <q-item-section v-if="task.done" side>
          <q-item-label>
            <q-btn
              @click.stop="showConfirmDialog(index)"
              flat
              round
              color="primary"
              dense
              icon="delete"
            />
          </q-item-label>
        </q-item-section>
      </q-item>
    </q-list>
    <div v-if="!tasks.length" class="no-tasks absolute-center">
      <q-icon name="check" size="100px" color="primary" />
      <div class="text-h5 text-primary text-center">일정을 등록해주세요.</div>
    </div>
  </q-page>

  <q-dialog v-model="confirm" persistent>
    <q-card>
      <q-card-section class="row items-center">
        <q-avatar icon="warning" color="primary" text-color="white" />
        <span class="q-ml-sm">정말로 삭제하시겠어요?</span>
      </q-card-section>

      <q-card-actions align="right">
        <q-btn flat label="취소" color="primary" v-close-popup />
        <q-btn
          flat
          label="삭제"
          color="primary"
          @click="deleteTask(confirmIndex)"
          v-close-popup
        />
      </q-card-actions>
    </q-card>
  </q-dialog>
</template>

<script>
import { defineComponent, reactive, ref } from "vue";
import { useQuasar } from "quasar";

export default defineComponent({
  name: "IndexPage",
  setup() {
    const newTask = ref("");

    const addTask = () => {
      tasks.push({
        title: newTask.value,
        done: true,
      });
      newTask.value = "";
    };
    const tasks = reactive([
      {
        title:
          "감상문 기능은 현재 개발중입니다. 이 페이지는 저장되지 않습니다.",
        done: false,
      },
      {
        title:
          "멘토에게 텍스트로 전달해주거나, 노션 링크를 받아서 기록해주세요!",
        done: false,
      },
      {
        title:
          "10th_불네오 : 새로운 분야에 발을 들인다는 것은 어디로 가야 할지 방향을 확신할 수 없기에 두렵고 불안하게 느껴지는 것 같습니다. 특히 모든 것은 경쟁이고, ‘남들’보다는 열심히, 그리고 잘해야 한다는 생각을 가지고 있어서 더욱 그랬습니다. 그렇기에 앞서 길을 나아간 멘토의 조언은 단순히 에세이를 하나의 인상깊은 이야기로 엮어서 풀 수 있도록 알려주고, 앞으로의 준비 방향을 추천하는 것을 넘어서 ‘남들’보다는 잘해야 한다는 조급함을 덜 수 있게 해주었습니다. 멘토링 덕분에 불안함을 가지고 아무거나 해보자는 방식에서 벗어나 명확한 길을 가지게 되었으므로, 비록 결과가 어떻게 되든 후회없는 준비를 할 수 있게 되었습니다. 그런 도움을 받은 저 또한 앞으로 새로운 분야에 들어서는 사람들이나 방향을 몰라서 불안한 사람들을 위해 조언을 해줄 수 있는 사람이 되자는 생각을 갖게 되었습니다.",
        done: false,
      },
      {
        title:
          "10th_라이언 : 안녕하세요.제게 이번 도전은 두 번째 싸피 도전입니다. 사실 이전 도전에서 왜 떨어졌는지 느끼지 못해 어떻게 자기소개서를 고쳐야 하나 골머리를 앓고 있었습니다. 그런데 이번에 블루베리님께 도움을 받고 나서 제가 강점으로 어필했던 부분이 오히려 독이 될 수 있었음을 깨닫게 되었고, 개선 방향에 대해서도 어느 정도 감을 잡을 수 있었습니다. 특히나 블루베리님과 같은 모바일 반을 희망하고 있던 저로서는, 모바일 반에 대해 좀 더 들을 수 있었고, 제게도 도움이 될 것이라는 확신을 할 수 있게 되어서 좋았습니다. 또한 안드로이드 개발자로 일본 취업까지 성공하셔서 관련 조언을 조금이나마 들을 수 있어서 블루베리님과의 멘토링이 큰 도움이 되었습니다. 이제 다시 자소서를 작성하는 단계고 새로운 고민점들도 여럿 생겨나고 있지만 열심히 써보고 더 발전된 모습으로 블루베리님께 보여드리고 싶습니다. 감사합니다!",
        done: false,
      },
      {
        title:
          "10th_성냥팔이 : 9기때도 지원했다가 떨어진 지원자로써, 이번에 이렇게 멘토링을 진행해주신 블루베리님께 너무나도 감사하단 말씀을 전하고 싶습니다. 무엇보다 저번 기수 지원하실 때 블루베리님이 어떻게 노력을 하셨는지 경험을 들을 기회가 마련되었는데,제가 무엇때문에 떨어졌는지 확실하게 느끼게 되었습니다.그로 인해 이번 10기 지원때는 어떤 방향으로 준비를 해야할지 감을 확실히 잡을 수 있게 되었습니다. 제 이야기를 다 들어주시고, 그에 맞게 방향을 잡아주셨습니다.그 뿐만 아니라, 저의 관점에서는 생각지도 못했던 관점으로 말씀해주셔서 더욱 대단함과 존경을 느끼게 되었습니다.  이 멘토링을 통해, 저는 불안했던 마음이 확고한 방향이 잡힘과 동시에 열정적으로 바뀌었고 더 노력을 해야겠다고 생각하게 되었습니다. 제가 말 정리를 잘 못하여서 전달이 잘 안됐을 수도 있지만, 진심으로 아주 커다란 원동력이 될 도움의 힘을 받았음을 말하고 싶습니다. 정말 감사합니다. 꼭 이 시간을 가짐으로써 저도 합격하게 되어 다음 기수에 지원하게 될 사람들에게 선배로써 도움을 주는 사람이 되고 싶음을 느꼈습니다. ",
        done: false,
      },
      {
        title:
          "10th_재개발자 :퇴근 하시고 피곤하셨을텐데도 밝고 상냥하게 멘토링해주셔서 감사했습니다! 특히 노션과 디스코드를 소개해주셔서 제가 고민했던 부분인 싸피 준비에서의 지속가능성에 대한 고민을 해결할 수 있어 좋았던 시간이였습니다 🙂감사합니다!!",
        done: false,
      },
      {
        title:
          "10th_수수 : 비교적 최근 지인에 의해서 싸피를 알게되어 지원하기로 마음먹게 되었고, 지원절차가 어떻게 되나 찾아보니 코딩테스트 > 면접이 있다는 사실을 알게되었습니다. 코딩테스트는 프로그래머스에서 진행하는 pccp 자격증말고는 경험이 없어 매우 걱정이 많았습니다. pccp 시험은 처음 알고리즘을 접하는 저에게는 너무 어려웠기에, 싸피에서도 그 정도 수준을 원할까봐 걱정이 많아 멘토링을 신청하게 되었습니다.구글폼에 코딩테스트 준비를 어떻게 해야 좋을까요? swea1 까지는 풀 수 있는 실력입니다. 라고 질문을 드렸는데, 궁금했던 백준과 swea 난이도를 말씀해 주시면서 기존에 알고있던 백준 단계별 문제풀기이외에도 [solved.ac](http://solved.ac)에서 class 해결하기라는 부분을 알려주셔서 많은 도움이 되었습니다. 또한 swea는 문제별로 편차가 있다는 사실을 알려주시면서 사람들이 많이 푼 문제위주로 풀어라는 조언을 해주셔서 앞으로 코딩테스트 하는데 많은 도움이 될 거 같습니다! 또한 싸피외에도 기업 코딩테스트의 꿀팁도 많이 전해주셔서 더욱 도움이 되었습니다. 바쁘실텐데도 불구하고, 시간을 내 멘토링 해주셔서 매우 감사합니다. 알려주신 조언으로 열심히 공부해 싸피뿐만이 아니라 가고싶었던 기업에 취업하도록 노력하겠습니다. 항상 좋은일만 가득하세요! 😊",
        done: false,
      },
      {
        title:
          "10th_우리집강아지송송이 : 이번 싸피 10기에 전공자로 지원하기 위해 준비하던 중 코딩테스트 준비 과정에서 부족한 부분을 느껴 멘토링을 신청하게 되었고, 멘토 Z님께 도움을 받았습니다. 제가 해오던 코딩테스트 공부 방식과, 목표치를 어느 정도로 잡으면 될지 등 준비 과정에 있어 확신이 들지 않아 멘토링을 받았는데, 제가 캐치하지 못했던 잘못 생각하고 있던 부분들을 바로 잡아 주시고 공부의 방향성을 세세하게 잡아주셔서 많은 도움이 되었습니다. 솔직히 멘토링을 받는다고 해서 큰 도움은 되지 않을 것이라는 생각을 가지고 있었지만, 이미 제가 준비하고 있는 과정의 길을 먼저 걸어본 멘토님과 말씀을 나누어보니 제가 길게 설명하지 않아도 제 입장을 금방 파악하시고, 현 상황에서 제게 가장 필요한 조언들을 정확히 알고 계셔서 예상치 못할 만큼 많은 도움을 받을 수 있었습니다. 덕분에 멘토링을 받기 전에 비해 마음 속의 불안함을 한결 덜어내고 확신을 가진 채 싸피를 준비할 수 있을 것 같습니다. 멘토링을 통해 아무리 좋은 말들을 많이 듣는다 하더라도 멘토님께서 해주신 조언들이 얼마나 좋은 양분이 될지는 멘티의 노력과 실천에 달린 것이라고 생각합니다. 따라서 멘토님께서 해주신 말씀들을 꼭 제 것으로 만들어 싸피 10기 합격을 위해 열심히 달려보겠습니다. 그리고 저와 같이 싸피를 준비하면서 다양한 고민을 가지고 계신 분들과 방향성을 잃은 듯한 느낌을 받은 분들은 멘토링을 통해 정말 많은 도움을 받을 수 있을 것 같기에 고민하지 마시고 꼭 신청해보실 것을 적극 추천합니다. 싸피 지원자들을 위해 바쁜 시간 쪼개어 멘토링을 진행해주시는 모든 멘토분들과 Z님께 다시 한번 감사드립니다.",
        done: false,
      },
      {
        title:
          "10th_다람 : 안녕하세요. 이번 10기 지원자 다람입니다~! 이번이 싸피 첫 지원이라 모르는 점이 많았지만, 멘토님께서 자소서 TIP, 싸피 입교 전 준비해야할 공부 등을 자세히 설명해주셔서 많은 도움이 되었습니다! 꼭 10기 합격하겠습니다. 도움을 주셔서 정말 감사합니다 😊",
        done: false,
      },
      {
        title:
          "10th_버스 : 안녕하세요! 이번에 처음으로 싸피를 지원하게 되었습니다. 퇴사를 결심하고, 처음이자 마지막 기회인 만큼 간절한 마음으로 싸피를 도전하게 되었습니다. 하지만 제가 잘 준비하고 있는건지 불안했고, 1:1로 상담을 받을 수 있는 사람도 없었습니다. 이 불안감을 블루베리님의 상담 덕분에 많이 해소할 수 있었습니다. 제가 궁금한 점이 많아서 질문을 많이 했는데 끝까지 친절하게 답변해주시고, 제 공부 방향을 좀 더 체계적으로 잡아주셨습니다. 다시한번 감사의 말씀 드립니다!!",
        done: false,
      },
      {
        title:
          "10th_싸피준비 : by 멘토 블루베리님, 부족한 점 많았는데 전반적으로 잘 파악해주셔서 취약점에 대한 코멘트를 얻을 수 있었습니다. 선배입장에서 제시해 주실 수 있는 관점과 연결고리가, 단순 공감이나 응원보다 더 큰 도움이 되었던 것 같습니다. 시간 내주셔서 감사드립니다.",
        done: false,
      },
      {
        title:
          "10th_상여자 : 오늘 처음 멘토분과 얘기하면서 제 에세이에 대한 문제점을 알게 되었고 제가 가지고 있던 마음가짐에도 변화가 생겼습니다. 덕분에 어떤 방향으로 잡고 에세이를 쓸 지 가닥이 잡힌 것 같습니다. 감사합니다. ",
        done: false,
      },
      {
        title:
          "10th_널널 : 제가 고민하는 부분에 대해서 말씀을 드렸었는데, 저의 입장에서 생각해주시고 답변을 해주셔서 싸피를 준비하면서 어떤 부분에 포인트를 잡고 준비해야 할지 방향성을 제안 해주시는점이 도움이 되었습니다. 감사합니다.",
        done: false,
      },
    ]);

    const deleteTask = (index) => {
      tasks.splice(index, 1);
      $q.notify("Deleted");
    };

    const showConfirmDialog = (index) => {
      confirm.value = true;
      confirmIndex.value = index;
    };

    const $q = useQuasar();
    const confirm = ref(false);
    const confirmIndex = ref(-1);

    return {
      addTask,
      newTask,
      tasks,
      deleteTask,
      confirm,
      confirmIndex,
      showConfirmDialog,
    };
  },
});
</script>

<style lang="scss">
.done {
  .toDoTitle {
    color: blue;
  }
}
.no-tasks {
  opacity: 0.5;
}
.bg-primary {
  background-color: white;
}
.q-item-section {
  font-family: "Gamja Flower", "sans-serif";
}
</style>
